In [6]:
import numpy as np
import pandas as pd

In [19]:
profiles = pd.read_csv("data/fully-unified-data/profiles/officer-profiles.csv", low_memory=False)
profiles.head()

,UID,first_name,last_name,middle_initial,middle_initial2,suffix_name,birth_year,race,gender,appointed_date,resignation_date,current_status,current_star,current_unit,current_rank,start_date,org_hire_date,profile_count,cleaned_rank,link_UID
0,100001,A,BRODERSON,F,NaN,NaN,1926.0,WHITE,MALE,1950-06-03,1980-03-10,0.0,NaN,NaN,NaN,NaN,NaN,3,NaN,2863.0
1,100002,A,DALESSANDRO,A,NaN,NaN,1923.0,WHITE,MALE,1956-09-01,1979-10-18,0.0,NaN,NaN,NaN,NaN,NaN,3,NaN,6100.0
2,100003,A,KIBURAS,J,NaN,NaN,1948.0,WHITE,MALE,1968-06-24,1980-10-01,0.0,NaN,NaN,NaN,NaN,NaN,3,NaN,14560.0
3,100004,A,KUSTRA,J,NaN,NaN,1923.0,WHITE,MALE,1953-09-28,1980-10-01,0.0,NaN,NaN,NaN,NaN,NaN,3,NaN,15445.0
4,100005,A,MC LAUGHLIN,R,NaN,NaN,1941.0,BLACK,MALE,1966-06-20,1986-09-16,0.0,NaN,123.0,POLICE OFFICER,NaN,NaN,3,POLICE OFFICER,18373.0

In [40]:
set(profiles['race'].tolist())

{'ASIAN/PACIFIC ISLANDER',
 'BLACK',
 'HISPANIC',
 'NATIVE AMERICAN/ALASKAN NATIVE',
 'WHITE',
 nan}

In [45]:
set(profiles['cleaned_rank'].tolist())

{'ASSISTANT DEPUTY SUPERINTENDENT',
 'ASSISTANT SUPERINTENDENT',
 'CAPTAIN',
 'CHIEF',
 'COMMANDER',
 'DEPUTY CHIEF',
 'DEPUTY SUPERINTENDENT',
 'DETECTIVE',
 'DIRECTOR OF CAPS',
 'FIELD TRAINING OFFICER',
 'FIRST DEPUTY SUPERINTENDENT',
 'LIEUTENANT',
 'OTHER',
 'POLICE OFFICER',
 'SERGEANT',
 'SUPERINTENDENT OF POLICE',
 "SUPERINTENDENT'S CHIEF OF STAFF",
 nan}

In [41]:
set(profiles['current_rank'].tolist())

{'ASSISTANT SUPERINTENDENT',
 'ASST DEPUTY SUP',
 'ASST DIR NEWS AFFAIR',
 'CAPTAIN OF POLICE',
 'CHIEF',
 'CHIEF SYS PROG IS',
 'CMDR',
 'CMDR TAFFIC ENFORCE',
 'COMM NEIGHBORHOOD RE',
 'COMM OF GENL SUPPORT',
 'COMMANDER',
 'COMMANDER SPEC SERV',
 'COMP TOOL MARK EXAM',
 'COOR /INVESTIGATIONS',
 'COOR SPEC EVENTS',
 'COORDINATOR',
 'DEP CHIEF',
 'DEPUTY SUPT.',
 'DET',
 'DIR LABOR RELATIONS',
 'DIR MGT/LAB AFFAIRS',
 'DIR OF MOTOR MAINT',
 'DIR PERSONNEL SERV',
 'DIRECTOR OF CAPS',
 'DIRECTOR OF RECORDS',
 'DIST WATCH CO',
 'EXPL TECH 1',
 'EXPL TECH 3',
 'EXPLOSIVES TECH 2',
 'EXTRADITION OFFICER',
 'F/A ID TECH 1',
 'F/A ID TECH 2',
 'FIRST DEPUTY SUPT.',
 'FORENSIC FIREARM/EVIDENCE IDENT TECH',
 'LIEUTENANT OF POLICE',
 'LT',
 'MANAGER POL PAYROLL',
 'P O ASSGN SEC SPEC',
 'P.O. ASSIGNED AS HELICOPTER PILOT',
 'PHYSICAL FITNES COOR',
 'PO',
 'PO (PER ARB AWARD)',
 'PO AS DETECTIVE',
 'PO AS SUPV POL INV',
 'PO ASGN EVID. TECHNI',
 'PO ASGN LATEN F/P EX',
 'PO ASGN SUPV LAT FP',
 'PO ASSG CANINE HANDL',
 'PO ASSGN TRAFF SPEC',
 'PO ASSIGN AS ARMORER',
 'PO LEGAL OFF 1',
 'PO LEGAL OFF 2',
 'PO SUB ABUSE COUNSLR',
 'PO/EXP DET CAN HAND',
 'PO/FIELD TRNING OFF',
 'PO/MARINE OFFICER',
 'PO/MOUNTED PAT OFF.',
 'POL FORENSIC INV I',
 'POL FORENSIC INV II',
 'POL FORENSIC INV III',
 'POL LAB TECH 2',
 'POL LAB TECH 4',
 'POLICE AGENT',
 'POLICE ARTIST',
 'POLICE OFFICER',
 'POLICE TECHNICIAN',
 'SERGEANT OF POLICE',
 'SERGEANT PER ARBITRA',
 'SGT',
 'SGT ASSGN SEC SPEC',
 'SR EVID TECH',
 'SUPT OF POLICE',
 "SUPT'S CHIEF OF STAFF",
 nan}

In [32]:
roster = pd.read_csv("data/fully-unified-data/roster/roster__2018-03.csv", low_memory=False)
roster.head()

,row_id,gender,race,current_age,is_sworn_officer,appointed_date,rank_no,unit_id,unit,unit_detail,...,first_name,first_name_NS,last_name,last_name_NS,middle_initial,middle_initial2,suffix_name,roster__2018-03_ID,UID,link_UID
0,1,MALE,HISPANIC,52.0,Y,1994-10-03,9161,6.0,1.0,NaN,...,ARTEMIO,ARTEMIO,PENA,PENA,NaN,NaN,NaN,1,101771.0,22174.0
1,2,MALE,WHITE,60.0,Y,1995-12-04,9161,6.0,1.0,NaN,...,JAMES,JAMES,MC HUGH,MCHUGH,P,NaN,NaN,2,111894.0,18280.0
2,3,MALE,WHITE,47.0,Y,1992-01-02,9161,23.0,1.0,18.0,...,MICHAEL,MICHAEL,DAHILL,DAHILL,J,NaN,NaN,3,120251.0,6073.0
3,4,MALE,BLACK,49.0,Y,1996-07-08,9161,6.0,1.0,NaN,...,JAMES,JAMES,JEFFRIES,JEFFRIES,F,NaN,NaN,4,111699.0,13376.0
4,5,MALE,WHITE,56.0,Y,1991-06-19,9171,6.0,1.0,NaN,...,JOHN,JOHN,OWEN,OWEN,W,NaN,NaN,5,114403.0,21539.0

In [18]:
salary = pd.read_csv("data/fully-unified-data/salary/salary_2002-2017_2017-09.csv")
salary.head()

,salary_2002-2017_2017-09_ID,row_id,pay_grade,rank,salary,employee_status,org_hire_date,spp_date,start_date,year,...,salary-2011_2002-2017_2017-09_ID,salary-2012_2002-2017_2017-09_ID,salary-2013_2002-2017_2017-09_ID,salary-2014_2002-2017_2017-09_ID,salary-2015_2002-2017_2017-09_ID,salary-2016_2002-2017_2017-09_ID,salary-2017_2002-2017_2017-09_ID,salary_2002-2017_2017-09_ID.1,UID,link_UID
0,1,1490,D|2A,POLICE OFFICER (ASSIGNED AS DETECTIVE),64356.0,CAREER SERVICE,1990-08-27,NaN,1990-08-27,2002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,100013,4443.0
1,2,6444,D|1,POLICE OFFICER,57426.0,CAREER SERVICE,1996-12-02,1996-12-02,1996-12-02,2002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,100014,4879.0
2,3,10542,D|1,POLICE OFFICER,61512.0,CAREER SERVICE,1986-09-11,1986-11-17,1986-11-17,2002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,100015,5520.0
3,4,11235,D|1,POLICE OFFICER,54672.0,CAREER SERVICE,1998-06-29,1998-06-29,1998-06-29,2002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,100016,5913.0
4,5,2884,D|1,POLICE OFFICER,52092.0,CAREER SERVICE,2000-02-28,2000-02-28,2000-02-28,2002,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5,100019,6388.0

In [17]:
settlements = pd.read_csv("data/fully-unified-data/settlements/settlements_1952-2016_2017-01.csv")
settlements.head()

,row_id,settlements_1952-2016_2017-01_ID,case_id,officer_id,complaint,incident_date,location,plantiff,settlement,service_length,UID
0,1,1,14-CV-4800,24165.0,False arrest,2016-06-22,Not specified,Jonathan Guzman,"$35,000","18 years, 6 months (active)",128103.0
1,2,1,14-CV-7969,24165.0,Excessive force/minor,2014-04-03,Not specified,Edward Resendiz,"$15,000","18 years, 6 months (active)",128103.0
2,3,1,15-CV-111,24165.0,False arrest,2013-11-08,6000 W. 56th St.,Lashaun Duprey,"$30,000","18 years, 6 months (active)",128103.0
3,4,1,13-CV-1477,24165.0,Excessive force/serious,2012-02-25,6300 W. 52nd St.,NaN,"$250,001","18 years, 6 months (active)",128103.0
4,5,1,10-CV-2916,24165.0,Excessive force/minor,2010-04-10,7600 S. Loomis Blvd.,Latoine Hull,"$8,273","18 years, 6 months (active)",128103.0

In [46]:
set(settlements['complaint'].tolist())

{'Attorney fees',
 'Conditions of confinement',
 'Dui stop',
 'Excessive force',
 'Excessive force/minor',
 'Excessive force/serious',
 'Extended detention',
 'Failure to provide medical care',
 'False arrest',
 'First amendment violation',
 'Illegal search/seizure',
 'Illinois domestic violence act',
 'Malicious prosecution',
 'Monell',
 'Other police misconduct',
 'Reversed conviction',
 'Wrongful death'}

In [21]:
awards = pd.read_csv("data/fully-unified-data/awards/awards_1967-2017_2017-08.csv", low_memory=False)
awards.head()

,row_id,awards_1967-2017_2017-08_ID,pps_award_detail_id,award_type,award_start_date,current_award_status,award_request_date,award_end_date,rank,last_promotion_date,requester_full_name,ceremony_date,tracking_no,UID,old_UID,link_UID
0,1,12311.0,8038267,HONORABLE MENTION,2008-07-25,DELETED,2008-07-27,2008-07-25,9171-SERGEANT OF POLICE,NaN,"OCHOA, PETER",NaN,HP-473677,112683.0,1.0,1.0
1,2,12311.0,8046162,ATTENDANCE RECOGNITION AWARD,2005-09-26,DELETED,2008-12-20,2008-09-26,9171-SERGEANT OF POLICE,NaN,"MAZUR, SANDY",NaN,NaN,112683.0,1.0,1.0
2,3,12311.0,8046771,HONORABLE MENTION,2009-01-03,DELETED,2009-01-04,2009-01-03,9171-SERGEANT OF POLICE,NaN,"NIEVES, ROBERTO",NaN,HR103338,112683.0,1.0,1.0
3,4,12311.0,8067659,HONORABLE MENTION,2010-09-21,DELETED,2010-09-27,2010-09-21,9171-SERGEANT OF POLICE,NaN,"TUNSTALL, TRACY",NaN,HS525635,112683.0,1.0,1.0
4,5,12311.0,8074425,HONORABLE MENTION,2011-06-03,DELETED,2011-06-10,2011-06-03,9171-SERGEANT OF POLICE,NaN,"DAVIES, TRACY",NaN,HT329393,112683.0,1.0,1.0

In [47]:
set(awards['award_type'].tolist())

{'2009 CRIME REDUCTION AWARD ',
 'ANNUAL BUREAU AWARD OF RECOGNITION',
 'ARNOLD MIRELES SPECIAL PARTNER',
 'ATTENDANCE RECOGNITION AWARD',
 'AWARD OF APPRECIATION',
 'CARTER HARRISON',
 'CHICAGO POLICE LEADERSHIP AWARD',
 'CIVILIAN SERVICE RECOGNITION AWARD',
 'COMPLIMENTARY LETTER',
 'DEPARTMENT COMMENDATION',
 'DEPLOYMENT OPERATIONS CENTER AWARD',
 'EMBLEM OF RECOGNITION - APPEARANCE',
 'EMBLEM OF RECOGNITION - PHYSICAL FITNESS',
 'HONOR GUARD AWARD',
 'HONORABLE MENTION',
 'HONORABLE MENTION RIBBON AWARD',
 'HUNDRED CLUB OF COOK COUNTY MEDAL OF VALOR',
 'JOINT OPERATIONS AWARD',
 'LAMBERT TREE',
 'LIFE SAVING AWARD',
 'MILITARY DEPLOYMENT AWARD',
 'MILITARY SERVICE AWARD',
 'NATO SUMMIT SERVICE AWARD',
 'OTHER AWARDS',
 'OUTSIDE GOVERNMENTAL AGENCY AWARD',
 'PIPE BAND AWARD',
 'POLICE BLUE SHIELD AWARD',
 'POLICE BLUE STAR AWARD',
 'POLICE MEDAL',
 'POLICE OFFICER OF THE MONTH AWARD',
 'PRESIDENTIAL ELECTION DEPLOYMENT AWARD 2008',
 'PROBLEM SOLVING AWARD',
 'RECOGNITION / OUTSIDE GOVERNMENTAL AGENCY AWARD',
 'SPECIAL COMMENDATION',
 'SPECIAL HONORABLE MENTION',
 'SPECIAL SERVICE AWARD',
 "SUPERINTENDENT'S AWARD OF TACTICAL EXCELLENCE",
 "SUPERINTENDENT'S HONORABLE MENTION",
 'SUPERINTENDENTS AWARD OF MERIT',
 'SUPERINTENDENTS AWARD OF VALOR',
 'THOMAS WORTHAM IV MILITARY AND COMMUNITY SERVICE AWARD',
 'TOP GUN ARREST AWARD',
 'TRAFFIC STOP OF THE MONTH AWARD ',
 'UNIT MERITORIOUS PERFORMANCE AWARD',
 'WILLIAM POWERS LEADERSHIP AWARD'}

In [30]:
complaints = pd.read_csv("data/fully-unified-data/complaints/complaints-complaints.csv", low_memory=False)
complaints.head()

,cr_id,cv,incident_date,complaint_date,closed_date,add1,add2,beat,city,full_address,location
0,1000194,2,2006-10-02,2006-10-02,NaN,7809,S SOUTH SHORE DR,0421,CHICAGO IL,NaN,17
1,1000214,3,2006-10-03,2006-10-04,2010-12-23,7100,South WESTERN AVE,832.0,CHICAGO ILLINOIS 60636,NaN,NaN
2,1002796,3,2006-12-15,2007-01-18,2008-12-15,325,North JEFFERSON ST,1212.0,CHICAGO ILLINOIS 60661,NaN,TAVERN/LIQUOR STORE
3,1003786,3,2007-03-01,2007-03-02,2011-02-23,NaN,West 87TH ST,834.0,CHICAGO ILLINOIS 60652,NaN,RESIDENCE
4,1005070,2,2007-04-20,2007-04-20,NaN,4010,W ERIE ST,0.0,CHICAGO IL,NaN,17

In [25]:
complainants = pd.read_csv("data/fully-unified-data/complaints/complaints-complainants.csv")
complainants.head()

    age  birth_year    cr_id  cv  gender      race
0  50.0         NaN  1001016   2    MALE     WHITE
1  49.0         NaN  1001016   2  FEMALE     WHITE
2  52.0         NaN  1001016   2    MALE  HISPANIC
3  51.0         NaN  1001090   2    MALE     WHITE
4  44.0         NaN  1001091   2    MALE     WHITE

In [27]:
victims = pd.read_csv("data/fully-unified-data/complaints/complaints-victims.csv")
victims.head()

    age  birth_year    cr_id  cv  gender      race
0  24.0         NaN  1000551   2    MALE     BLACK
1  51.0         NaN  1000861   2  FEMALE     BLACK
2   NaN         NaN  1001509   2    MALE     WHITE
3   NaN         NaN  1001880   2  FEMALE     BLACK
4   NaN         NaN  1003246   2    MALE  HISPANIC

In [31]:
accused = pd.read_csv("data/fully-unified-data/complaints/complaints-accused.csv", low_memory=False)
accused.head()

,UID,complaint_category,complaint_code,cr_id,cv,final_finding,final_outcome,recc_finding,recc_outcome,link_UID
0,130469.0,SUPERVISOR RESPONSIBILITY: FAIL TO OBTAIN COM...,12D,C170981,1,NS,NO ACTION TAKEN,NaN,NaN,20040.0
1,103495.0,EXCESSIVE FORCE: ARRESTEE - DURING ARREST,05A,C170981,1,NS,NO ACTION TAKEN,NaN,NaN,7727.0
2,111845.0,EXCESSIVE FORCE: ARRESTEE - DURING ARREST,05A,C170981,1,NS,NO ACTION TAKEN,NaN,NaN,17149.0
3,126148.0,EXCESSIVE FORCE: ARRESTEE - DURING ARREST,05A,C170981,1,NS,NO ACTION TAKEN,NaN,NaN,271.0
4,127906.0,EXCESSIVE FORCE: ARRESTEE - DURING ARREST,05A,C170981,1,NS,NO ACTION TAKEN,NaN,NaN,11004.0